tutorials-pM4F/constantVelocityFoam/phreeqcRM/calciteDissolutionDolomitePrecipitation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     constantVelocityFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3600;

deltaT          0.5; //75;

writeControl    runTime;

writeInterval   600;

purgeWrite      0;

writeFormat     ascii;

writePrecision  4;

writeCompression off;

timeFormat      general;

timePrecision  7; 

runTimeModifiable true;

maxCo 10; // Or other Courant number you wish

adjustTimeStep no; // Or no

maxDeltaT 0.75; //Maximum deltaT in seconds

///libs ( "libphreeqcrm-3.3.12.so" );

// ************************************************************************* //
