tutorials-pM4F/constantVelocityFoam/phreeqcRM/calciteDissolutionDolomitePrecipitation/system/sG
start   (0.005 0.05 0.05);
end     (0.495 0.05 0.05);
fields  (Ys.Calcite Y.Cl Y.C Y.Ca Y.Mg Ys.Dolomite);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.

setConfig
{
    axis x;        // y, z, xyz
    nPoints		50;
}

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
